# Код Морзе для представления цифр и букв использует тире и точки. Напишите
# функцию для кодирования текстового сообщения в соответствии с кодом Морзе.
# (словари в помощь)
def text_on_morze(text):
    text = text.upper()
    result = ''
    morze_dict = {
        'A': '.-',
        'B': '-...',
        'C': '-.-.',
        'D': '-..',
        'E': '.',
        'F': '..-.',
        'G': '--.',
        'H': '....',
        'I': '..',
        'J': '.---',
        'K': '-.-',
        'L': '.-..',
        'M': '--',
        'N': '-.',
        'O': '---',
        'P': '.--.',
        'Q': '--.-',
        'R': '.-.',
        'S': '...',
        'T': '-',
        'U': '..-',
        'V': '...-',
        'W': '.--',
        'X': '-..-',
        'Y': '-.--',
        'Z': '--..'
        # 0: '-----',
        # 1: '.----',
        # 2: '..---',
        # 3: '...--',
        # 4: '....-',
        # 5: '.....',
        # 6: '-....',
        # 7: '--...',
        # 8: '---..',
        # 9: '----.'
    }
    for i in text:
        result += morze_dict.get(i) + ' '
    return result.strip()


text_from_keybord = text_on_morze(input())
print(text_from_keybord)
