# Без использования collections, написать программу, которая будет
# создавать словарь для подсчитывания количества вхождений каждой
# буквы в текст введенный с клавиатуры
text = 'hello'
data = {i: i for i in text}
print(data)

numbers = [i for i in range(1, 100, 2)]
print(numbers)
